docs/load-test/20260130-095144-redis.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0031/1000 VUs, 109 complete and 0 interrupted iterations
load_test   [   1% ] 0031/1000 VUs  0m00.9s/2m00.0s

running (0m01.9s), 0064/1000 VUs, 515 complete and 0 interrupted iterations
load_test   [   2% ] 0064/1000 VUs  0m01.9s/2m00.0s

running (0m02.9s), 0098/1000 VUs, 1174 complete and 0 interrupted iterations
load_test   [   2% ] 0098/1000 VUs  0m02.9s/2m00.0s

running (0m03.9s), 0131/1000 VUs, 1959 complete and 0 interrupted iterations
load_test   [   3% ] 0131/1000 VUs  0m03.9s/2m00.0s

running (0m04.9s), 0164/1000 VUs, 2739 complete and 0 interrupted iterations
load_test   [   4% ] 0164/1000 VUs  0m04.9s/2m00.0s

running (0m05.9s), 0198/1000 VUs, 3524 complete and 0 interrupted iterations
load_test   [   5% ] 0198/1000 VUs  0m05.9s/2m00.0s

running (0m06.9s), 0231/1000 VUs, 4306 complete and 0 interrupted iterations
load_test   [   6% ] 0231/1000 VUs  0m06.9s/2m00.0s

running (0m07.9s), 0264/1000 VUs, 5089 complete and 0 interrupted iterations
load_test   [   7% ] 0264/1000 VUs  0m07.9s/2m00.0s

running (0m08.9s), 0298/1000 VUs, 5865 complete and 0 interrupted iterations
load_test   [   7% ] 0298/1000 VUs  0m08.9s/2m00.0s

running (0m09.9s), 0331/1000 VUs, 6633 complete and 0 interrupted iterations
load_test   [   8% ] 0331/1000 VUs  0m09.9s/2m00.0s

running (0m10.9s), 0364/1000 VUs, 7421 complete and 0 interrupted iterations
load_test   [   9% ] 0364/1000 VUs  0m10.9s/2m00.0s

running (0m11.9s), 0398/1000 VUs, 8173 complete and 0 interrupted iterations
load_test   [  10% ] 0398/1000 VUs  0m11.9s/2m00.0s

running (0m12.9s), 0431/1000 VUs, 8963 complete and 0 interrupted iterations
load_test   [  11% ] 0431/1000 VUs  0m12.9s/2m00.0s

running (0m13.9s), 0464/1000 VUs, 9803 complete and 0 interrupted iterations
load_test   [  12% ] 0464/1000 VUs  0m13.9s/2m00.0s

running (0m14.9s), 0498/1000 VUs, 10612 complete and 0 interrupted iterations
load_test   [  12% ] 0498/1000 VUs  0m14.9s/2m00.0s

running (0m15.9s), 0531/1000 VUs, 11406 complete and 0 interrupted iterations
load_test   [  13% ] 0531/1000 VUs  0m15.9s/2m00.0s

running (0m16.9s), 0564/1000 VUs, 12200 complete and 0 interrupted iterations
load_test   [  14% ] 0564/1000 VUs  0m16.9s/2m00.0s

running (0m17.9s), 0598/1000 VUs, 12998 complete and 0 interrupted iterations
load_test   [  15% ] 0598/1000 VUs  0m17.9s/2m00.0s

running (0m18.9s), 0631/1000 VUs, 13781 complete and 0 interrupted iterations
load_test   [  16% ] 0631/1000 VUs  0m18.9s/2m00.0s

running (0m19.9s), 0664/1000 VUs, 14571 complete and 0 interrupted iterations
load_test   [  17% ] 0664/1000 VUs  0m19.9s/2m00.0s

running (0m20.9s), 0698/1000 VUs, 15376 complete and 0 interrupted iterations
load_test   [  17% ] 0698/1000 VUs  0m20.9s/2m00.0s

running (0m21.9s), 0731/1000 VUs, 16159 complete and 0 interrupted iterations
load_test   [  18% ] 0731/1000 VUs  0m21.9s/2m00.0s

running (0m22.9s), 0764/1000 VUs, 16924 complete and 0 interrupted iterations
load_test   [  19% ] 0764/1000 VUs  0m22.9s/2m00.0s

running (0m23.9s), 0798/1000 VUs, 17686 complete and 0 interrupted iterations
load_test   [  20% ] 0798/1000 VUs  0m23.9s/2m00.0s

running (0m24.9s), 0831/1000 VUs, 18474 complete and 0 interrupted iterations
load_test   [  21% ] 0831/1000 VUs  0m24.9s/2m00.0s

running (0m25.9s), 0864/1000 VUs, 19289 complete and 0 interrupted iterations
load_test   [  22% ] 0864/1000 VUs  0m25.9s/2m00.0s

running (0m26.9s), 0898/1000 VUs, 20070 complete and 0 interrupted iterations
load_test   [  22% ] 0898/1000 VUs  0m26.9s/2m00.0s

running (0m27.9s), 0931/1000 VUs, 20681 complete and 0 interrupted iterations
load_test   [  23% ] 0931/1000 VUs  0m27.9s/2m00.0s

running (0m28.9s), 0964/1000 VUs, 21460 complete and 0 interrupted iterations
load_test   [  24% ] 0964/1000 VUs  0m28.9s/2m00.0s

running (0m29.9s), 0998/1000 VUs, 22344 complete and 0 interrupted iterations
load_test   [  25% ] 0998/1000 VUs  0m29.9s/2m00.0s

running (0m30.9s), 1000/1000 VUs, 23179 complete and 0 interrupted iterations
load_test   [  26% ] 1000/1000 VUs  0m30.9s/2m00.0s

running (0m31.9s), 1000/1000 VUs, 24000 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m31.9s/2m00.0s

running (0m32.9s), 1000/1000 VUs, 24785 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m32.9s/2m00.0s

running (0m33.9s), 1000/1000 VUs, 25572 complete and 0 interrupted iterations
load_test   [  28% ] 1000/1000 VUs  0m33.9s/2m00.0s

running (0m34.9s), 1000/1000 VUs, 26372 complete and 0 interrupted iterations
load_test   [  29% ] 1000/1000 VUs  0m34.9s/2m00.0s

running (0m35.9s), 1000/1000 VUs, 27180 complete and 0 interrupted iterations
load_test   [  30% ] 1000/1000 VUs  0m35.9s/2m00.0s

running (0m36.9s), 1000/1000 VUs, 27977 complete and 0 interrupted iterations
load_test   [  31% ] 1000/1000 VUs  0m36.9s/2m00.0s

running (0m37.9s), 1000/1000 VUs, 28768 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m37.9s/2m00.0s

running (0m38.9s), 1000/1000 VUs, 29557 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m38.9s/2m00.0s

running (0m39.9s), 1000/1000 VUs, 30334 complete and 0 interrupted iterations
load_test   [  33% ] 1000/1000 VUs  0m39.9s/2m00.0s

running (0m40.9s), 1000/1000 VUs, 30886 complete and 0 interrupted iterations
load_test   [  34% ] 1000/1000 VUs  0m40.9s/2m00.0s

running (0m41.9s), 1000/1000 VUs, 31707 complete and 0 interrupted iterations
load_test   [  35% ] 1000/1000 VUs  0m41.9s/2m00.0s

running (0m42.9s), 1000/1000 VUs, 32572 complete and 0 interrupted iterations
load_test   [  36% ] 1000/1000 VUs  0m42.9s/2m00.0s

running (0m43.9s), 1000/1000 VUs, 33372 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m43.9s/2m00.0s

running (0m44.9s), 1000/1000 VUs, 34180 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m44.9s/2m00.0s

running (0m45.9s), 1000/1000 VUs, 35021 complete and 0 interrupted iterations
load_test   [  38% ] 1000/1000 VUs  0m45.9s/2m00.0s

running (0m46.9s), 1000/1000 VUs, 35806 complete and 0 interrupted iterations
load_test   [  39% ] 1000/1000 VUs  0m46.9s/2m00.0s

running (0m47.9s), 1000/1000 VUs, 36615 complete and 0 interrupted iterations
load_test   [  40% ] 1000/1000 VUs  0m47.9s/2m00.0s

running (0m48.9s), 1000/1000 VUs, 37421 complete and 0 interrupted iterations
load_test   [  41% ] 1000/1000 VUs  0m48.9s/2m00.0s

running (0m49.9s), 1000/1000 VUs, 38226 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m49.9s/2m00.0s

running (0m50.9s), 1000/1000 VUs, 39031 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m50.9s/2m00.0s

running (0m51.9s), 1000/1000 VUs, 39794 complete and 0 interrupted iterations
load_test   [  43% ] 1000/1000 VUs  0m51.9s/2m00.0s

running (0m52.9s), 1000/1000 VUs, 40574 complete and 0 interrupted iterations
load_test   [  44% ] 1000/1000 VUs  0m52.9s/2m00.0s

running (0m53.9s), 1000/1000 VUs, 41227 complete and 0 interrupted iterations
load_test   [  45% ] 1000/1000 VUs  0m53.9s/2m00.0s

running (0m54.9s), 1000/1000 VUs, 41673 complete and 0 interrupted iterations
load_test   [  46% ] 1000/1000 VUs  0m54.9s/2m00.0s

running (0m55.9s), 1000/1000 VUs, 42179 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m55.9s/2m00.0s

running (0m56.9s), 1000/1000 VUs, 42748 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m56.9s/2m00.0s

running (0m57.9s), 1000/1000 VUs, 43411 complete and 0 interrupted iterations
load_test   [  48% ] 1000/1000 VUs  0m57.9s/2m00.0s

running (0m58.9s), 1000/1000 VUs, 44056 complete and 0 interrupted iterations
load_test   [  49% ] 1000/1000 VUs  0m58.9s/2m00.0s

running (0m59.9s), 1000/1000 VUs, 44689 complete and 0 interrupted iterations
load_test   [  50% ] 1000/1000 VUs  0m59.9s/2m00.0s

running (1m00.9s), 1000/1000 VUs, 45361 complete and 0 interrupted iterations
load_test   [  51% ] 1000/1000 VUs  1m00.9s/2m00.0s

running (1m01.9s), 1000/1000 VUs, 46028 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m01.9s/2m00.0s

running (1m02.9s), 1000/1000 VUs, 46789 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m02.9s/2m00.0s

running (1m03.9s), 1000/1000 VUs, 47631 complete and 0 interrupted iterations
load_test   [  53% ] 1000/1000 VUs  1m03.9s/2m00.0s

running (1m04.9s), 1000/1000 VUs, 48406 complete and 0 interrupted iterations
load_test   [  54% ] 1000/1000 VUs  1m04.9s/2m00.0s

running (1m05.9s), 1000/1000 VUs, 49214 complete and 0 interrupted iterations
load_test   [  55% ] 1000/1000 VUs  1m05.9s/2m00.0s

running (1m06.9s), 1000/1000 VUs, 50036 complete and 0 interrupted iterations
load_test   [  56% ] 1000/1000 VUs  1m06.9s/2m00.0s

running (1m07.9s), 1000/1000 VUs, 50840 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m07.9s/2m00.0s

running (1m08.9s), 1000/1000 VUs, 51730 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m08.9s/2m00.0s

running (1m09.9s), 1000/1000 VUs, 52548 complete and 0 interrupted iterations
load_test   [  58% ] 1000/1000 VUs  1m09.9s/2m00.0s

running (1m10.9s), 1000/1000 VUs, 53338 complete and 0 interrupted iterations
load_test   [  59% ] 1000/1000 VUs  1m10.9s/2m00.0s

running (1m11.9s), 1000/1000 VUs, 54178 complete and 0 interrupted iterations
load_test   [  60% ] 1000/1000 VUs  1m11.9s/2m00.0s

running (1m12.9s), 1000/1000 VUs, 55008 complete and 0 interrupted iterations
load_test   [  61% ] 1000/1000 VUs  1m12.9s/2m00.0s

running (1m13.9s), 1000/1000 VUs, 55794 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m13.9s/2m00.0s

running (1m14.9s), 1000/1000 VUs, 56653 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m14.9s/2m00.0s

running (1m15.9s), 1000/1000 VUs, 57483 complete and 0 interrupted iterations
load_test   [  63% ] 1000/1000 VUs  1m15.9s/2m00.0s

running (1m16.9s), 1000/1000 VUs, 58265 complete and 0 interrupted iterations
load_test   [  64% ] 1000/1000 VUs  1m16.9s/2m00.0s

running (1m17.9s), 1000/1000 VUs, 59041 complete and 0 interrupted iterations
load_test   [  65% ] 1000/1000 VUs  1m17.9s/2m00.0s

running (1m18.9s), 1000/1000 VUs, 59855 complete and 0 interrupted iterations
load_test   [  66% ] 1000/1000 VUs  1m18.9s/2m00.0s

running (1m19.9s), 1000/1000 VUs, 60658 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m19.9s/2m00.0s

running (1m20.9s), 1000/1000 VUs, 61460 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m20.9s/2m00.0s

running (1m21.9s), 1000/1000 VUs, 62203 complete and 0 interrupted iterations
load_test   [  68% ] 1000/1000 VUs  1m21.9s/2m00.0s

running (1m22.9s), 1000/1000 VUs, 63020 complete and 0 interrupted iterations
load_test   [  69% ] 1000/1000 VUs  1m22.9s/2m00.0s

running (1m23.9s), 1000/1000 VUs, 63803 complete and 0 interrupted iterations
load_test   [  70% ] 1000/1000 VUs  1m23.9s/2m00.0s

running (1m24.9s), 1000/1000 VUs, 64595 complete and 0 interrupted iterations
load_test   [  71% ] 1000/1000 VUs  1m24.9s/2m00.0s

running (1m25.9s), 1000/1000 VUs, 65409 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m25.9s/2m00.0s

running (1m26.9s), 1000/1000 VUs, 66193 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m26.9s/2m00.0s

running (1m27.9s), 1000/1000 VUs, 66980 complete and 0 interrupted iterations
load_test   [  73% ] 1000/1000 VUs  1m27.9s/2m00.0s

running (1m28.9s), 1000/1000 VUs, 67738 complete and 0 interrupted iterations
load_test   [  74% ] 1000/1000 VUs  1m28.9s/2m00.0s

running (1m29.9s), 1000/1000 VUs, 68556 complete and 0 interrupted iterations
load_test   [  75% ] 1000/1000 VUs  1m29.9s/2m00.0s

running (1m30.9s), 0988/1000 VUs, 69290 complete and 0 interrupted iterations
load_test   [  76% ] 0988/1000 VUs  1m30.9s/2m00.0s

running (1m31.9s), 0952/1000 VUs, 70128 complete and 0 interrupted iterations
load_test   [  77% ] 0952/1000 VUs  1m31.9s/2m00.0s

running (1m32.9s), 0928/1000 VUs, 70930 complete and 0 interrupted iterations
load_test   [  77% ] 0928/1000 VUs  1m32.9s/2m00.0s

running (1m33.9s), 0891/1000 VUs, 71720 complete and 0 interrupted iterations
load_test   [  78% ] 0891/1000 VUs  1m33.9s/2m00.0s

running (1m34.9s), 0859/1000 VUs, 72491 complete and 0 interrupted iterations
load_test   [  79% ] 0859/1000 VUs  1m34.9s/2m00.0s

running (1m35.9s), 0818/1000 VUs, 73289 complete and 0 interrupted iterations
load_test   [  80% ] 0818/1000 VUs  1m35.9s/2m00.0s

running (1m36.9s), 0792/1000 VUs, 74046 complete and 0 interrupted iterations
load_test   [  81% ] 0792/1000 VUs  1m36.9s/2m00.0s

running (1m37.9s), 0756/1000 VUs, 74822 complete and 0 interrupted iterations
load_test   [  82% ] 0756/1000 VUs  1m37.9s/2m00.0s

running (1m38.9s), 0717/1000 VUs, 75616 complete and 0 interrupted iterations
load_test   [  82% ] 0717/1000 VUs  1m38.9s/2m00.0s

running (1m39.9s), 0688/1000 VUs, 76437 complete and 0 interrupted iterations
load_test   [  83% ] 0688/1000 VUs  1m39.9s/2m00.0s

running (1m40.9s), 0652/1000 VUs, 77215 complete and 0 interrupted iterations
load_test   [  84% ] 0652/1000 VUs  1m40.9s/2m00.0s

running (1m41.9s), 0621/1000 VUs, 77978 complete and 0 interrupted iterations
load_test   [  85% ] 0621/1000 VUs  1m41.9s/2m00.0s

running (1m42.9s), 0586/1000 VUs, 78787 complete and 0 interrupted iterations
load_test   [  86% ] 0586/1000 VUs  1m42.9s/2m00.0s

running (1m43.9s), 0558/1000 VUs, 79575 complete and 0 interrupted iterations
load_test   [  87% ] 0558/1000 VUs  1m43.9s/2m00.0s

running (1m44.9s), 0514/1000 VUs, 80430 complete and 0 interrupted iterations
load_test   [  87% ] 0514/1000 VUs  1m44.9s/2m00.0s

running (1m45.9s), 0483/1000 VUs, 81199 complete and 0 interrupted iterations
load_test   [  88% ] 0483/1000 VUs  1m45.9s/2m00.0s

running (1m46.9s), 0450/1000 VUs, 81956 complete and 0 interrupted iterations
load_test   [  89% ] 0450/1000 VUs  1m46.9s/2m00.0s

running (1m47.9s), 0414/1000 VUs, 82741 complete and 0 interrupted iterations
load_test   [  90% ] 0414/1000 VUs  1m47.9s/2m00.0s

running (1m48.9s), 0382/1000 VUs, 83476 complete and 0 interrupted iterations
load_test   [  91% ] 0382/1000 VUs  1m48.9s/2m00.0s

running (1m49.9s), 0344/1000 VUs, 84351 complete and 0 interrupted iterations
load_test   [  92% ] 0344/1000 VUs  1m49.9s/2m00.0s

running (1m50.9s), 0317/1000 VUs, 85115 complete and 0 interrupted iterations
load_test   [  92% ] 0317/1000 VUs  1m50.9s/2m00.0s

running (1m51.9s), 0279/1000 VUs, 85966 complete and 0 interrupted iterations
load_test   [  93% ] 0279/1000 VUs  1m51.9s/2m00.0s

running (1m52.9s), 0244/1000 VUs, 86789 complete and 0 interrupted iterations
load_test   [  94% ] 0244/1000 VUs  1m52.9s/2m00.0s
time="2026-01-30T09:58:29+09:00" level=warning msg="Request Failed" error="request timeout"
time="2026-01-30T09:58:29+09:00" level=warning msg="Request Failed" error="request timeout"
time="2026-01-30T09:58:29+09:00" level=warning msg="Request Failed" error="request timeout"
[...]

running (1m53.9s), 0212/1000 VUs, 87556 complete and 0 interrupted iterations
load_test   [  95% ] 0212/1000 VUs  1m53.9s/2m00.0s
time="2026-01-30T09:58:30+09:00" level=warning msg="Request Failed" error="request timeout"

running (1m54.9s), 0175/1000 VUs, 88374 complete and 0 interrupted iterations
load_test   [  96% ] 0175/1000 VUs  1m54.9s/2m00.0s
time="2026-01-30T09:58:31+09:00" level=warning msg="Request Failed" error="request timeout"
time="2026-01-30T09:58:31+09:00" level=warning msg="Request Failed" error="request timeout"

running (1m55.9s), 0139/1000 VUs, 89196 complete and 0 interrupted iterations
load_test   [  97% ] 0139/1000 VUs  1m55.9s/2m00.0s

running (1m56.9s), 0106/1000 VUs, 90003 complete and 0 interrupted iterations
load_test   [  97% ] 0106/1000 VUs  1m56.9s/2m00.0s

running (1m57.9s), 0071/1000 VUs, 90755 complete and 0 interrupted iterations
load_test   [  98% ] 0071/1000 VUs  1m57.9s/2m00.0s

running (1m58.9s), 0039/1000 VUs, 91248 complete and 0 interrupted iterations
load_test   [  99% ] 0039/1000 VUs  1m58.9s/2m00.0s

running (1m59.9s), 0005/1000 VUs, 91449 complete and 0 interrupted iterations
load_test   [ 100% ] 0005/1000 VUs  1m59.9s/2m00.0s
time="2026-01-30T09:58:37+09:00" level=warning msg="Request Failed" error="request timeout"


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=1.66s
    ✓ 'p(99)<5000' p(99)=3.26s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 182908 1514.900451/s
    checks_succeeded...: 83.37% 152500 out of 182908
    checks_failed......: 16.62% 30408 out of 182908

    ✗ status is 200
      ↳  99% — ✓ 91446 / ✗ 8
    ✗ response time < 1000ms
      ↳  66% — ✓ 61054 / ✗ 30400

    HTTP
    http_req_duration..............: avg=886.96ms min=6.05ms   med=829.31ms max=1m0s   p(90)=1.43s p(95)=1.66s
      { expected_response:true }...: avg=881.79ms min=6.05ms   med=829.28ms max=37.59s p(90)=1.43s p(95)=1.66s
    http_req_failed................: 0.00%  8 out of 91454
    http_reqs......................: 91454  757.450225/s

    EXECUTION
    iteration_duration.............: avg=988.71ms min=106.09ms med=930.5ms  max=1m0s   p(90)=1.53s p(95)=1.76s
    iterations.....................: 91454  757.450225/s
    vus............................: 5      min=5          max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 1.2 GB 10 MB/s
    data_sent......................: 10 MB  83 kB/s



running (2m00.7s), 0000/1000 VUs, 91454 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 0000/1000 VUs  2m0s
time="2026-01-30T09:58:37+09:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"